[
{
    "patrol_id": "mtn_bord_rogue1",
    "biome": "mountainous",
    "season": "Any",
    "tags": ["border", "fighting", "scar", "FACE", "battle_injury", "multi_deaths", "reputation"],
    "intro_text": "As the patrol is marking the border lines, a Vulture flys down out from the sky! A sneak attack!",
    "decline_text": "The patrol turns tail and races away! The borders left open for the vulture to calm.",
    "chance_of_success": 20,
    "exp": 30,
    "success_text": [
        "The patrol descends into battle without a second thought, easily driving the vulture away as they use their knowledge of the rocky terrain to their advantage.",
        null,
        "s_c immediately leaps to protect their Slugmates, their ferocity in battle quickly terrifying the vulture. Realizing that they've sorely underestimated the slug cats, the vulture turn tail and run.",
        "s_c revels in the battle, leaping into the fray with their claws bared and spears ready. The vulture are quickly driven away by the patrol."
    ],
    "fail_text": [
        null,
        null,
        "The vulture are terrifyingly coordinated and are quick to use the patrol's shock and confusion against them. The patrol cats are picked off one by one, only a couple managing to escape the slaughter.",
        "Taken by surprise, the patrol scatters and loses cohesion. The vulture are quick to take advantage of the confusion and eventually the patrol retreats, r_c badly wounded."
    ],
    "win_skills": ["excellent fighter"],
    "win_trait": ["bloodthirsty", "fierce", "vengeful"],
    "min_cats": 4,
    "max_cats": 6,
    "antagonize_text": null,
    "antagonize_fail_text": null,
    "history_text": {
        "scar": "r_c was badly scarred when vulture ambushed their patrol.",
        "reg_death": "This cat was killed when a vulture ambushed their patrol.",
        "lead_death": "were killed in a vulture ambush"
    }
},  
{    
    "patrol_id": "mtn_bord_rogue2",
    "biome": "mountainous",
    "season": "Any",
    "tags": ["border", "fighting", "death", "reputation"],
    "intro_text": "As the patrol is marking the border lines, a Vulture flys down out from the sky! A sneak attack!",
    "decline_text": "r_c turns tail and races away! The vulture has more claws to deal with, warning the Clan is more important than dying needlessly.",
    "chance_of_success": 30,
    "exp": 30,
    "success_text": [
        "Stunned for a moment, r_c is nearly caught in the teeth of the vulture, but they use their superior knowledge of the rocky terrain to dodge and weave through the onslaught of attacks, eventually escaping the fray and pelting towards camp with yowls of warning bursting from their lungs.",
        null,
        "s_c snarls at the vulture, outnumbered but not cowed. They throw themselves at the intruders with such ferocity and fury that the rogues are taken aback. Alarmed by the lack of fear and self-preservation from the Clan cat, the rogues freeze. s_c sees their opportunity to run and takes it, racing back to the camp to gather more warriors and return."
    ],
    "fail_text": [
        null,
        "s_c raises their spear at the vulture, out clawed but not cowed. They throw themselves at the intruders with such ferocity and fury that the vulture is taken aback. For a moment the vulture is stunned by the reaction, but the shock doesn't last long before they descend upon the adulit slugcat once more. Eventually, s_c has no choice but to escape before they're killed.",
        "The vulture greatly out claw r_c and have no trouble killing the lone cat. Their body is never found."
    ],
    "win_skills": ["excellent fighter"],
    "fail_trait": ["bloodthirsty", "fierce", "vengeful"],
    "min_cats": 1,
    "max_cats": 1,
    "antagonize_text": null,
    "antagonize_fail_text": null,
    "history_text": {
        "reg_death": "This cat was killed when a vulture ambushed them while on a solo patrol.",
        "lead_death": "were killed in a vulture ambush"
    }
},
{    
    "patrol_id": "mtn_bord_rogue3",
    "biome": "mountainous",
    "season": "Any",
    "tags": ["border", "fighting", "scar", "THROAT", "battle_injury", "multi_deaths", "reputation", "respect", "trust"],
    "intro_text": "As the patrol is marking the border lines, a gang of slug cats strides confidently out from behind a tumble of rocks, yowling as they confront the Clan cats!",
    "decline_text": "The patrol turns tail and races away! The borders left open for the slug cats to claim.",
    "chance_of_success": 20,
    "exp": 30,
    "success_text": [
        "The slug cats posture and jeer, eventually provoking a battle. The Clan cats are strong, however, and the slug cats seem to be weakened by hunger. The patrol easily drives the intruders away.",
        "The slug cats posture and jeer, eventually provoking a battle. The Clan cats are strong, however, and experienced at using the rocky terrain to their advantage, the slug cats are forced to retreat.",
        "s_c takes the lead, confronting the gang with confidence. Eventually the slug cat admit that they've been struggling to find enough prey and were looking to steal richer territory from the Clan. Tensions are eased when s_c informs the slugcats of a prey-rich meadow outside of c_n territory.",
        "s_c takes the lead, confronting the gang with confidence. Eventually the slug cats admit that they've been struggling to find enough prey and were looking to steal richer territory from the Clan. Tensions are eased when s_c informs the slugcats of a prey-rich meadow outside of c_n territory."
    ],
    "fail_text": [
        null,
        null,
        "The slug cats are terrifyingly coordinated and are quick to use the patrol's momentary surprise to their advantage. The patrol cats are picked off one by one, only a couple managing to escape the slaughter.",
        "The slug cats posture and jeer, eventually provoking a battle. They prove to be strong fighters and eventually the patrol is forced to retreat, r_c badly injured."
    ],
    "win_skills": ["good speaker", "great speaker", "excellent speaker"],
    "win_trait": ["bold", "confident", "charming"],
    "min_cats": 4,
    "max_cats": 6,
    "antagonize_text": "The patrol descends into battle without a second thought, eventually driving the slugcats away.",
    "antagonize_fail_text": "The patrol descends into battle without a second thought, but the slugcats are stronger than expected and eventually the patrol is forced to retreat.",
    "history_text": {
        "scar": "r_c was badly scarred when slugcats attacked their patrol.",
        "reg_death": "This cat was killed when slugcat attacked their patrol.",
        "lead_death": "were killed in a slugcat ambush"
    }
},
{
"patrol_id": "mtn_bord_story1",
"biome": "mountainous",
"season": "Any",
"tags": ["border", "platonic", "comfort", "respect", "big_change", "rel_patrol", "patrol_to_r_c"],
"intro_text": "On their way to mark the far corners of their mountain, r_c starts telling a story of their ancestors to keep every cat entertained.",
"decline_text": "A shadow flies over them, and r_c's storytelling is forgotten as the patrol makes sure it wasn't an eagle.",
"chance_of_success": 20,
"exp": 20,
"success_text": [
        "It keeps the cats' minds off their sore pads and the sharp stones they walk on. The patrol goes quickly and easily.",
        null,
        "s_c spins a story, vivid and engaging, telling the tale of a massive war their ancestors fought over the border the patrol is headed to mark. Not only does it keep every cat entertained, it really emphasizes the importance of the patrol and motivates everyone.",
        "It's a fantastic idea, making the patrol fly by as cats chat and laugh with their Clanmates, and everyone ends the day feeling much closer to each other."
],
"fail_text": [
        "The rocky terrain is too rough to keep up a story, and eventually r_c peters out, breathless and panting.",
        "s_c takes r_c aside, and reminds them coldly to focus on their duties."
],
"win_skills": ["good speaker", "great speaker", "excellent speaker"],
"win_trait": ["charismatic", "childish", "playful", "empathetic", "loving", "patient"],
"fail_trait": ["cold", "strict", "righteous", "responsible", "thoughtful", "wise"],
"min_cats": 3,
"max_cats": 6,
"antagonize_text": null,
"antagonize_fail_text": null
}
]
